## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.rg-terraform must be replaced
-/+ resource "azurerm_resource_group" "rg-terraform" {
      ~ id       = "/subscriptions/0bcdd247-28cc-4143-9247-6149a34d75ea/resourceGroups/rg-terraform-github-actions" -> (known after apply)
      ~ location = "eastus" -> "japaneast" # forces replacement
        name     = "rg-terraform-github-actions"
      - tags     = {} -> null
    }

  # azurerm_virtual_network.name will be destroyed
  # (because azurerm_virtual_network.name is not in configuration)
  - resource "azurerm_virtual_network" "name" {
      - address_space           = [
          - "10.1.0.0/16",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "b9eaab4b-82b3-4fa0-9964-411751c380ee" -> null
      - id                      = "/subscriptions/0bcdd247-28cc-4143-9247-6149a34d75ea/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/vnet-terraform-github-actions" -> null
      - location                = "eastus" -> null
      - name                    = "vnet-terraform-github-actions" -> null
      - resource_group_name     = "rg-terraform-github-actions" -> null
      - subnet                  = [] -> null
      - tags                    = {} -> null
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0./16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "vnet-terraform-github-actions"
      + resource_group_name = "rg-terraform-github-actions"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>